app/views/top_notices/index.html.haml

:javascript
  $("#top_notice_receiver_type").change(function(){
    $receivers = $("#top_notice_receivers");
    $receivers.empty().val("");
    switch(~~$(this).val()) {
      case 1:
        $receivers.addClass("hidden")
        $receivers.select2('destroy');
        break;
      case 2:
        $receivers.removeClass("hidden");
        $receivers.select2_remote();
        break;
      case 3:
        $receivers.removeClass("hidden");
        $receivers.select2({data: #{Dept.select2_available_depts.to_json}});
        break;
    }
  })
---
SELECT `depts`.* FROM `depts` WHERE (parentNo in ('88100006'))