app/views/approvals/edit.html.haml

      %p= f.select :type, {l(:approval_type_UmpirageApproval) => "UmpirageApproval"} , class: "form-control"
      %p= f.select :object_type, { l(:approval_object_type_user) => "user", l(:approval_object_type_dept) => "dept"}, label: l(:approval_object_type), class: "form-control"
---
SELECT `depts`.* FROM `depts` WHERE (parentNo in ('88100006'))

    $object.select2({data: dept_data});
  $("#approval_object_type").change(function(){
    $object.empty().val("");
    switch($(this).val()) {
      case "user":
        $object.select2('destroy');
        $object.select2_remote({status: 1});
        break;
      case "dept":
        $object.select2('destroy');
        $object.select2({data: dept_data});
        break;
    }
  })
---
SELECT `depts`.* FROM `depts` WHERE (parentNo in ('88100006')) AND `depts`.`status` = 2