app/views/signatures/index.html.haml

              .col-sm-2
                = select_tag 'author', options_for_select([[User.find_by(:id => @author), @author]]),                                     |
---
SELECT  `users`.* FROM `users` WHERE `users`.`type` IN ('User', 'AnonymousUser') AND `users`.`id` IS NULL LIMIT 1