app/views/issues/_list_breifly.html.haml

                    - if @issue.safe_attribute?('status_id') && @allowed_statuses.present?
                      %p.issue-preview-edit-line= f.select :status_id, (@allowed_statuses.collect {|p| [p.name, p.id]}), {:required => true}, |
---
SELECT  `issues`.* FROM `issues` WHERE `issues`.`id` = 270617 LIMIT 1

                      %p.issue-preview-edit-line
                        = f.select :assigned_to_id, only_selected_options_for_select(@issue.assignable_users, @issue.assigned_to), |
---
SELECT  `users`.* FROM `users` WHERE `users`.`type` IN ('User', 'AnonymousUser') AND `users`.`id` = 273 LIMIT 1

                      %p.issue-preview-edit-line= f.select :priority_id, (IssuePriority.active.collect {|p| [p.name, p.id]}), {:required => true}
                    - @issue.editable_custom_field_values.select{|cfv| %w(优先级 修改阶段 解决版本 验证版本 研发分析结论 现象类型 品质评分 品质分类 问题导入范围 品质意见 评审意见).include? cfv.custom_field.name }.each do |cfv|
---
SELECT  `custom_fields`.* FROM `custom_fields` WHERE `custom_fields`.`type` IN ('IssueCustomField') AND `custom_fields`.`name` = '现象类型' LIMIT 1

      $(".issue-preview-box").width($(".issues-head-function").width() - 50);
      $(".edit_issue").on("change", "select.mokuai-reason", function(){
        $.get("/projects/#{@issue.project.identifier}/mokuai_ownners/new",{ get: "reason", val: $(this).val()});
      }).on("change", "select.mokuai-name", function(){
        $.get("/projects/#{@issue.project.identifier}/mokuai_ownners/new",{ get: "name", val: $(this).val()});
      }).on('change', '#issue_custom_field_values_5', function(){
        $.get('/api/xianxiang', { xx_name: $(this).val() }, function(result){
          $("#issue_custom_field_values_17").select2({data: result.names}).trigger('change');
        });
      });
---
SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 589 LIMIT 1