app/views/groups/_users.html.haml

SELECT  1 AS one FROM `users` INNER JOIN `groups_users` ON `users`.`id` = `groups_users`.`user_id` WHERE `users`.`type` IN ('User', 'AnonymousUser') AND `groups_users`.`group_id` = 3408 LIMIT 1
SELECT `users`.* FROM `users` INNER JOIN `groups_users` ON `users`.`id` = `groups_users`.`user_id` WHERE `users`.`type` IN ('User', 'AnonymousUser') AND `groups_users`.`group_id` = 3408
---
  %li= link_to l(:label_user_import), "javascript:;", :class => "icon icon-add icon-import"
- if @group.users.any?