app/views/users/_mail_notifications.html.haml

  = render_project_nested_lists(@user.projects) do |project| |
      content_tag('label',                                   |
        check_box_tag(                                       |
          'user[notified_project_ids][]',                    |
           project.id,                                       |
           @user.notified_projects_ids.include?(project.id), |
           :id => nil                                        |
        ) + ' ' + h(project.name)                            |
      )                                                      |
---
SELECT  1 AS one FROM `projects` INNER JOIN `members` ON `projects`.`id` = `members`.`project_id` WHERE `members`.`user_id` = 1 AND (projects.status<>9) LIMIT 1