app/views/principal_memberships/_index.html.haml

    %tbody
      - principal.memberships.preload(:member_roles => :role).each do |membership|
---
SELECT `member_roles`.* FROM `member_roles` WHERE `member_roles`.`member_id` IN (1530701, 1515230, 1644669, 1647354, 1663231, 1665920, 1734121, 1800423)
SELECT `roles`.* FROM `roles` WHERE `roles`.`id` IN (32)