app/views/projects/_form.html.haml

= labelled_fields_for :project, @project do |f|
  - if (["projects"]).include?(controller_name) || (["project"]).include?(action_name)
---
SELECT `projects`.* FROM `projects` WHERE (projects.status = 1)