app/views/projects/index.html.haml


  $(function() {
    $(".project-search > .search-box").trigger('input');
  });
---
SELECT  `projects`.* FROM `projects` WHERE (projects.status <> 9) AND (identifier = 'gnsz6758_66_n' OR LOWER(name) = 'gnsz6758_66_n')  ORDER BY `projects`.`id` ASC LIMIT 1