app/views/specs/_modify.html.haml

      .col-xs-6
        - projects = @project.show_by(4) ? Production.all : Project.default
---
SELECT `projects`.* FROM `projects` WHERE (category <> 4)