app/views/versions/jenkins.html.haml

SELECT  `users`.* FROM `users` WHERE `users`.`type` IN ('User', 'AnonymousUser') AND `users`.`id` = 683 LIMIT 1
---
                .col-sm-2
                  = select_tag 'author', options_for_select([[User.find_by(:id => @author), @author]], @author),                                     |