app/views/mokuais/index.html.haml

SELECT `mokuais`.`category` FROM `mokuais`
---
        = label_tag 'category', l(:field_category)
        = select_tag 'category', options_for_select( Mokuai.pluck(:category).uniq.map{  |
          |m| [m, m]}.unshift([l(:label_all), '']), @category), class: "form-control",  |