app/views/periodic_versions/index.html.haml

SELECT  `users`.* FROM `users` WHERE `users`.`type` IN ('User', 'AnonymousUser') AND `users`.`id` IS NULL LIMIT 1
---
          = label_tag 'author', l(:field_author)
          = select_tag 'author', options_for_select([[User.find_by(:id => @author), @author]], @author) ,  |