app/controllers/account_controller.rb

  def set_autologin_cookie(user)
    token = Token.create(:user => user, :action => 'autologin')
    secure = Redmine::Configuration['autologin_cookie_secure']
    if secure.nil?
      secure = request.ssl?
    end
    cookie_options = {
      :value => token.value,
      :expires => 1.year.from_now,
      :path => (Redmine::Configuration['autologin_cookie_path'] || RedmineApp::Application.config.relative_url_root || '/'),
      :secure => secure,
      :httponly => true
---
INSERT INTO `tokens` (`user_id`, `action`, `created_on`, `updated_on`, `value`) VALUES (5392, 'session', '2018-04-08 14:19:19', '2018-04-08 14:19:19', 'b91c1bb3d93e3ede9eb2673385d5d865886e7f3f')
SELECT  `users`.* FROM `users` WHERE `users`.`type` IN ('User', 'AnonymousUser') AND `users`.`id` = 5392 LIMIT 1