app/controllers/api_controller.rb

SELECT  `depts`.* FROM `depts` WHERE `depts`.`id` = 2 LIMIT 1
---
  def depts_tree
    dept_id = params[:id].to_s[/\d+/]
    dept = Dept.find(dept_id)

SELECT `depts`.* FROM `depts` WHERE (parentNo in ('10100000'))
---
  def dept_users
    dept_id = params[:dept_id].to_s[/\d+/]
    user_name = params[:name]

    dept = Dept.find(dept_id) rescue nil