app/controllers/apk_bases_controller.rb

    scope = scope.where(android_platform: @android_platform) if @android_platform.present?

    @count = scope.length
    @pages = Paginator.new @count, @limit, params['page']
    @offset ||= @pages.offset
    @apks = scope.limit(@limit).offset(@offset).to_a

    @project_apks = ProjectApk.joins(:project).select("projects.name, project_id").uniq
---
SELECT DISTINCT name, `project_apks`.`project_id` FROM `project_apks` INNER JOIN `projects` ON `projects`.`id` = `project_apks`.`project_id`