app/controllers/approvals_controller.rb

SELECT `approvals`.* FROM `approvals`
---
  def index
    @approvals = $db.slave { Approval.all.to_a }

SELECT  `approvals`.* FROM `approvals` WHERE `approvals`.`id` = 64 LIMIT 1
---
  def edit
    @approval = Approval.find_by(:id => params[:id])