app/controllers/conditions_controller.rb

SELECT  `conditions`.* FROM `conditions` WHERE `conditions`.`user_id` = 1 AND (column_order <> '')  ORDER BY `conditions`.`updated_at` DESC LIMIT 1
---
  def conditioncolumn
    # retrieve_query
    # columns = @query.available_columns.collect {|column| {:text => column.caption, :for => column.name.to_s}}
    # columns.delete_at(0) #Remove ID
    last_columns = User.current.conditions.column_order_last
    last_columns = last_columns.column_order if last_columns.present? && last_columns.column_order.present?