app/controllers/custom_permissions_controller.rb

    scope = CustomPermission.includes(:user)
    @user = User.current
    if @user.admin?
      @manages = scope.where(permission_type: CustomPermission::CUSTOM_PERMISSION_MANAGE)
      common_scope =  scope.where(permission_type: CustomPermission::CUSTOM_PERMISSION_COMMON)
    else
      manage_list = @user.user_custom_permission_manage.map{|e| e.gsub("_manage", "_apply")}
      common_scope =  scope.where(permission_type: manage_list)
    end

    @limit = per_page_option
    @count = common_scope.count
    @pages = Paginator.new @count, @limit, params['page']
    @offset ||= @pages.offset
    @commons = common_scope.limit(@limit).offset(@offset).reorder("created_at desc").to_a
---
SELECT `users`.* FROM `users` WHERE `users`.`type` IN ('User', 'AnonymousUser') AND `users`.`id` IN (890, 363, 198, 893, 2492, 4246, 221, 45, 2352, 2717, 2349, 2699, 3558, 2649, 1984, 1243, 2342, 94, 855, 530, 904, 3200, 93)
SELECT `custom_permissions`.* FROM `custom_permissions` WHERE `custom_permissions`.`permission_type` IN ('project_branch_judge', 'production_repo_judge', 'project_branch_manage', 'production_branch_manage', 'production_repo_manage')
SELECT COUNT(*) FROM `custom_permissions` WHERE `custom_permissions`.`permission_type` IN ('project_branch_apply', 'production_branch_apply', 'production_repo_apply')
SELECT  `custom_permissions`.* FROM `custom_permissions` WHERE `custom_permissions`.`permission_type` IN ('project_branch_apply', 'production_branch_apply', 'production_repo_apply')  ORDER BY created_at desc LIMIT 25 OFFSET 0