app/controllers/exports_controller.rb

SELECT `exports`.* FROM `exports` WHERE `exports`.`user_id` = 1 AND `exports`.`deleted` = 0  ORDER BY `exports`.`created_at` DESC
---
  def index
    user_exports = Export.mine.undeleted.order(created_at: :desc).map do |export|