app/controllers/google_tools_controller.rb

  def index
    auth :google_tool
    @cts_ctsv_tools = GoogleTool.where(category: 10).valid_tools
---
SELECT `google_tools`.* FROM `google_tools` WHERE `google_tools`.`category` = 10 AND (closed_at >= '2018-04-19' OR closed_at IS NULL)  ORDER BY android_version desc, created_at desc