app/controllers/issues_controller.rb

  def breifly
    @allowed_statuses = @issue.new_statuses_allowed_to(User.current)
    @journals = @issue.journals.includes(:user, :details).
                    references(:user, :details).
                    reorder(:created_on => :desc).to_a
---
SELECT `users`.id FROM `users` INNER JOIN `groups_users` ON `users`.`id` = `groups_users`.`group_id` WHERE `users`.`type` IN ('Group', 'GroupBuiltin', 'GroupAnonymous', 'GroupNonMember') AND `groups_users`.`user_id` = 1