app/controllers/my_controller.rb

  def account
    @user = User.current
    @pref = @user.pref
    if request.post?
      @user.safe_attributes = params[:user].except(:name, :mail) if params[:user]
      @user.pref.attributes = params[:pref] if params[:pref]
      # Change Password
      if params[:user] && params[:user][:old_password]
        old_pass, new_pass = params[:user][:old_password], params[:user][:new_password]
        change_password_status = @user.change_password(old_pass, new_pass) if old_pass.present? && new_pass.present?
---
SELECT  `users`.* FROM `users` WHERE `users`.`type` IN ('User', 'AnonymousUser') AND `users`.`status` = 1 AND `users`.`id` = 1 LIMIT 1