app/controllers/new_features_controller.rb

SELECT `new_features`.* FROM `new_features`  ORDER BY `new_features`.`created_at` DESC
---
  def index
    # search = params[:q]
    # if search.present?
    #   scope = NewFeature.where("subject like ?", "%#{search}%")
    # else
    #   scope = NewFeature.all
    # end
    # @pages = (params['page'] || 1).to_i
    # @limit = (params['per_page'] || 25).to_i
    # @new_feature_count = scope.count
    # @new_feature_pages = Paginator.new @new_feature_count, @limit, @pages
    # @new_features = scope.limit(@limit).offset(@limit*(@pages-1))
    @new_features = NewFeature.all