app/controllers/okrs_controller.rb

    scope = @current_user.okrs_records.includes(:approver)

    @limit = per_page_option
    @count = scope.count
    @pages = Paginator.new @count, @limit, params['page']
    @offset ||= @pages.offset
    @okrs = scope.limit(@limit).offset(@offset).reorder("created_at desc").to_a

    @approvings = OkrsRecord.where(status: %w(approving other_scoring), approver_id: current_user.id)

    @supports = OkrsSupport.my

    if @current_user.admin?
      @setting = OkrsSetting.last || OkrsSetting.new
---
SELECT `okrs_records`.* FROM `okrs_records` WHERE `okrs_records`.`approver_id` = 1 AND `okrs_records`.`status` IN ('approving', 'other_scoring')
SELECT  `okrs_settings`.* FROM `okrs_settings`  ORDER BY `okrs_settings`.`id` DESC LIMIT 1