app/controllers/productions_controller.rb

  def index
    @type = params[:type]
    @active_productions = Production.classify(true)
    @unactive_productions = Production.classify(false)
    @active_total = 0
    @unactive_total = 0

    if @type.present?

      @my_productions = User.current.productions
      @productions = policy(:production).view_all? ? Production.all : @my_productions

      @productions = @productions.where(:production_type => @type)
      @my_productions = @my_productions.where(:production_type => @type)

      if params[:closed]
        @productions = @productions.where("status <> #{params[:closed]}")
        @my_productions = @my_productions.where("status <> #{params[:closed]}")
---
SELECT  `users`.* FROM `users` WHERE `users`.`type` IN ('AnonymousUser')  ORDER BY `users`.`id` ASC LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`type` IN ('User', 'AnonymousUser') AND `users`.`status` = 1 AND `users`.`id` = 5392 LIMIT 1