app/controllers/projects_controller.rb

          scope = $db.slave { scope.active }
        end
        @projects = $db.slave { scope.projects_by_odm(tab).to_a }
---
SELECT  `projects`.* FROM `projects` WHERE (projects.status <> 9) AND (identifier = 'gnsz6758_66_n' OR LOWER(name) = 'gnsz6758_66_n')  ORDER BY `projects`.`id` ASC LIMIT 1

  def show
    auth @project if @project.category.to_i != 4

    ### View Project Record Start ###
    @project.add_view_record
    ### View Project Record End   ###

    # try to redirect to the requested menu item
    if params[:jump] && redirect_to_project_menu_item(@project, params[:jump])
      return
    end

    @users_by_role = $db.slave { @project.users_by_role(21) } #limit 21 records
    @subprojects = $db.slave { @project.children.visible.to_a }
    @news = $db.slave { @project.news.limit(5).includes(:author, :project).reorder("#{News.table_name}.created_on DESC").to_a }
    @trackers = $db.slave { @project.rolled_up_trackers }

    cond = $db.slave { @project.project_condition(Setting.display_subprojects_issues?) }

    # @open_issues_by_tracker = Issue.visible.open.where(cond).group(:tracker).count
    # @total_issues_by_tracker = Issue.visible.where(cond).group(:tracker).count
    @open_issues_by_tracker = $db.slave { Issue.visible.open.where(cond).group(:tracker_id).count }
    @total_issues_by_tracker = $db.slave { Issue.visible.where(cond).group(:tracker_id).count }

    if User.current.allowed_to_view_all_time_entries?(@project)
      @total_hours = $db.slave { TimeEntry.visible.where(cond).sum(:hours).to_f }
---
SELECT  `users`.* FROM `users` WHERE `users`.`type` IN ('User', 'AnonymousUser') AND `users`.`id` = 32 LIMIT 1
INSERT INTO `view_records` (`container_id`, `container_type`, `user_id`, `created_at`, `updated_at`) VALUES (531, 'Project', 1, '2018-04-19 16:02:41', '2018-04-19 16:02:41')
SELECT  `news`.* FROM `news` WHERE `news`.`project_id` = 531  ORDER BY news.created_on DESC LIMIT 5
SELECT `projects`.* FROM `projects` WHERE (parent_id in (531)) AND (projects.status <> 9)
SELECT  `projects`.* FROM `projects` WHERE (projects.status <> 9) AND (identifier = 'gnsz6758_66_n' OR LOWER(name) = 'gnsz6758_66_n')  ORDER BY `projects`.`id` ASC LIMIT 1
SELECT  `settings`.* FROM `settings` WHERE `settings`.`name` = 'display_subprojects_issues'  ORDER BY `settings`.`id` DESC LIMIT 1

    @key = User.current.rss_key

    #GMS
    @approveds = $db.slave { @project.versions.where(status: 7) }
---
SELECT `versions`.* FROM `versions` WHERE `versions`.`project_id` = 531 AND `versions`.`status` = 7  ORDER BY versions.effective_date DESC, versions.name DESC