app/controllers/repos_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`type` IN ('User', 'AnonymousUser') AND `users`.`id` = 2651 LIMIT 1
---
  def getlink
    project_id = params['project_id']
    projects_repos = $db.slave { Repo.get_link(project_id) }
    projects_repos.each do |r|
      puts r
      r['category_name'] = Repo.get_category_name(r['category'])
      r['author_name'] = User.find(r['author_id']).name