app/controllers/repo_requests_controller.rb

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` IN (79, 197, 105, 103, 991, 116, 319, 98, 215, 608, 213, 59, 80, 654, 97, 219, 202)
SELECT `versions`.* FROM `versions` WHERE `versions`.`id` IN (29789, 16984, 29762, 29704, 29335, 29243, 28899, 28555, 5807, 8253, 28383, 27585, 28166, 26987, 19321, 18635, 27565, 25101, 26248, 17598, 26377, 8438, 25801, 17642, 24502)
---
  def find_all_by_category
    @repo_requests = RepoRequest.where(category: RepoRequest::REPO_REQUEST_CATEGORY[params[:category].to_sym]).includes(:author, :project, :version)