app/controllers/resourcings_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`type` IN ('User', 'AnonymousUser') AND `users`.`id` = 1
SELECT COUNT(*) FROM `users` WHERE `users`.`type` IN ('User', 'AnonymousUser') AND `users`.`id` = 1
SELECT `resourcings`.* FROM `resourcings` WHERE `resourcings`.`user_id` IN (1)
---
  def edit_permission
    user_id  = params[:user_id]
    users_id = _ = params[:user_ids]; _.is_a?(Array) ? _ : _.to_s.split(/\s+/)

    @users = User.where(:id => user_id)  if user_id.present?
    @users = User.where(:id => users_id) if users_id.present?
    @users = (@users || query_user).includes(:resourcing)