app/controllers/specs_controller.rb

  def index
    @project_id = params[:project_id]
    @project = Project.find_by_identifier(@project_id)

    respond_to do |format|
      format.html {
        @pages = (params['page'] || 1).to_i
        @limit = (params['per_page'] || 150).to_i

        @specs = @project.specs.undeleted
        @my_productions = my_productions

        unless @specs.blank?
          @spec_id = params[:id].blank? ? @specs.first.id : params[:id]
          @spec = Spec.find(@spec_id)
          if @spec.present?
            @spec_name = @spec.name
            sql = "specs.id = #{@spec_id}"
            sql << " and app.id in (#{@my_productions.ids.join(',')})" if @my_productions.present? && User.current.is_app_spm?(@project)
---
SELECT  `projects`.* FROM `projects` WHERE `projects`.`identifier` = 'SW17G07A' LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`type` IN ('User', 'AnonymousUser') AND `users`.`id` = 1006 LIMIT 1
SELECT `projects`.`id` FROM `projects` WHERE (id = 531 OR parent_id = 531)

  def find_project(project_id)
    @project = Project.find(project_id)
---
SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 111 LIMIT 1