app/controllers/top_notices_controller.rb

  def index
    @top_notice = TopNotice.new
    @top_notices = TopNotice.all.order(:created_at => :desc)
---
SELECT  `top_notices`.* FROM `top_notices`  ORDER BY `top_notices`.`created_at` DESC LIMIT 1