app/controllers/users_controller.rb

SELECT COUNT(*) FROM `users` WHERE `users`.`type` IN ('User', 'AnonymousUser') AND (users.status <> 0) AND `users`.`status` = 1 AND (users.id IN (SELECT gu.user_id FROM groups_users gu WHERE gu.group_id = 3261))
SELECT `users`.`firstname` FROM `users` WHERE `users`.`type` IN ('User', 'AnonymousUser') AND (length(firstname)>0 and status=1) GROUP BY `users`.`firstname` HAVING count(id)>1
---
    scope = $db.slave { scope.in_group(params[:group_id]) } if params[:group_id].present?

    @user_count = scope.count
    @user_pages = Paginator.new @user_count, @limit, params['page']
    @offset ||= @user_pages.offset
    @users =  $db.slave { scope.order(sort_clause).limit(@limit).offset(@offset).to_a }

    @repeat_name = $db.slave { User.select(:firstname).where("length(firstname)>0 and status=1").group(:firstname).having("count(id)>1") }

SELECT  `users`.* FROM `users` WHERE `users`.`type` IN ('User', 'AnonymousUser') AND `users`.`id` = 56 LIMIT 1
SELECT `members`.* FROM `members` INNER JOIN `projects` ON `projects`.`id` = `members`.`project_id` WHERE `members`.`user_id` = 56 AND (projects.status<>9) AND (projects.status <> 9)
---
  def show
    unless @user.visible?
      render_404
      return
    end

    # show projects based on current user visibility
    @memberships = $db.slave { @user.memberships.where(Project.visible_condition(User.current)).to_a }

SELECT  `users`.* FROM `users` WHERE `users`.`type` IN ('User', 'AnonymousUser') AND `users`.`admin` = 1 LIMIT 1
SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
---
  def assigned
    name = params[:name]
    page = params[:page] || 1
    limit = 20
    offset = (page.to_i - 1) * limit
    which = User.where("type = ? AND id > ?", "user", User.find_by(admin: true))

    if params[:project_id].present?
      project = Project.find_by(id: params[:project_id])

SELECT `users`.* FROM `users` WHERE `users`.`type` IN ('Group', 'GroupBuiltin', 'GroupAnonymous', 'GroupNonMember') AND `users`.`type` = 'Group'
---
  def find_user
    if params[:id] == 'current'
      require_login || return
      @user = User.current
    else
      @user = User.find(params[:id])