app/controllers/versions_controller.rb

      scope = scope.group("case when group_key IS NULL then versions.id else group_key end")
                   .having("locate(#{Version.consts[:compile_status][:compiling]}, group_concat(compile_status))<=0")
    end

    respond_to do |format|
      format.html{
        sort_init 'id', 'desc'
        sort_update %w(id priority compile_status name compile_machine signature compile_type
                   compile_start_on compile_end_on compile_due_on author_id )
        @limit = params[:per_page].present? ? params[:per_page].to_i : 25
---
SELECT  `versions`.* FROM `versions`  ORDER BY id DESC LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM `versions`