app/views/trackers/index.html.haml

        %td
          - unless tracker.workflow_rules.count > 0
---
SELECT COUNT(*) FROM `workflows` WHERE `workflows`.`tracker_id` = 1