app/views/repo_requests/index.html.haml

            - if %w(project_branch production_branch).include?(params[:category])
              %td= r.version_id.blank? ?  r.tag_number : link_to(r.try(:version).try(:name), version_path(r.version))
---
SELECT `versions`.* FROM `versions` WHERE `versions`.`id` IN (29789, 16984, 29762, 29704, 29335, 29243, 28899, 28555, 5807, 8253, 28383, 27585, 28166, 26987, 19321, 18635, 27565, 25101, 26248, 17598, 26377, 8438, 25801, 17642, 24502)