app/views/layouts/_navigation.html.haml

              %li
                %a{:href => project_board_path(Project.first.to_param,1)}
---
SELECT  `projects`.* FROM `projects`  ORDER BY `projects`.`id` ASC LIMIT 1